{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "AppleRHI",
			"Children": [
				{
					"Source": {
						"Text": "-sm6 is selected but Mac requires OS 15 to support SM6"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "MetalRHIOptionsError"
				},
				{
					"Source": {
						"Text": "No Targeted RHI is set for this project, defaulting to SM5"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "MetalMissingTargetError"
				}
			]
		},
		{
			"Namespace": "BuildPatchInstallError",
			"Children": [
				{
					"Source": {
						"Text": "A file access error has occurred. Please check your running processes."
					},
					"Translation": {
						"Text": "出现文件访问错误。请检查您的运行过程。"
					},
					"Key": "BuildPatchInstallShortError_MoveFileToInstall"
				},
				{
					"Source": {
						"Text": "A file corruption has occurred. Please try again."
					},
					"Translation": {
						"Text": "发生文件损坏。请重试。"
					},
					"Key": "BuildPatchInstallShortError_FileConstructionFail"
				},
				{
					"Source": {
						"Text": "An unknown error ocurred. Please contact support."
					},
					"Translation": {
						"Text": "出现未知错误。请联系客服。"
					},
					"Key": "BuildPatchInstallShortError_InvalidOrMax"
				},
				{
					"Source": {
						"Text": "Could not download patch data. Please check your internet connection, and try again."
					},
					"Translation": {
						"Text": "无法下载补丁数据。请检查网络连接后重试。"
					},
					"Key": "BuildPatchInstallShortError_DownloadError"
				},
				{
					"Source": {
						"Text": "Low-level failure to write files to disk during installation. Verify there is sufficient disk space. {RequiredBytes} more is required."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "InstallationWriteFailed"
				},
				{
					"Source": {
						"Text": "Maximum path length exceeded. Please specify a shorter install location."
					},
					"Translation": {
						"Text": "超出了最大路径长度。请指定一个名称较短的安装位置。"
					},
					"Key": "BuildPatchInstallShortError_PathLengthExceeded"
				},
				{
					"Source": {
						"Text": "Not enough disk space available. Please free up some disk space and try again."
					},
					"Translation": {
						"Text": "可用的磁盘空间不足。请释放一些磁盘空间并重试。"
					},
					"Key": "BuildPatchInstallShortError_OutOfDiskSpace"
				},
				{
					"Source": {
						"Text": "Patching service could not start. Please contact support."
					},
					"Translation": {
						"Text": "补丁无法启动。请联系客服。"
					},
					"Key": "BuildPatchInstallShortError_ApplicationError"
				},
				{
					"Source": {
						"Text": "The application is closing."
					},
					"Translation": {
						"Text": "应用程序正在关闭。"
					},
					"Key": "BuildPatchInstallShortError_ApplicationClosing"
				},
				{
					"Source": {
						"Text": "The application's uninstall action has failed to execute. Please contact support."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "BuildPatchInstallShortError_UninstallCustomActionError"
				},
				{
					"Source": {
						"Text": "The following directory could not be created.\n{0}"
					},
					"Translation": {
						"Text": "无法创建以下目录。\n{0}"
					},
					"Key": "MissingStageDirectory"
				},
				{
					"Source": {
						"Text": "The installation directory could not be created.\n{0}"
					},
					"Translation": {
						"Text": "无法创建安装目录。\n{0}"
					},
					"Key": "MissingInstallDirectory"
				},
				{
					"Source": {
						"Text": "The installation is corrupt. Please contact support."
					},
					"Translation": {
						"Text": "安装已损坏。请联系客服。"
					},
					"Key": "BuildPatchInstallShortError_BuildCorrupt"
				},
				{
					"Source": {
						"Text": "The installer failed to initialize. Please contact support."
					},
					"Translation": {
						"Text": "安装程序初始化失败。请联系客服。"
					},
					"Key": "BuildPatchInstallShortError_InitializationError"
				},
				{
					"Source": {
						"Text": "The necessary prerequisites have failed to install. Please contact support."
					},
					"Translation": {
						"Text": "无法安装先决条件。请联系客服。"
					},
					"Key": "BuildPatchInstallShortError_PrerequisiteError"
				},
				{
					"Source": {
						"Text": "The operation was successful."
					},
					"Translation": {
						"Text": "操作成功。"
					},
					"Key": "BuildPatchInstallShortError_NoError"
				},
				{
					"Source": {
						"Text": "There is not enough space at {Location}\n{RequiredBytes} is required.\n{AvailableBytes} is available.\nYou need an additional {SpaceAdditional} to perform the installation."
					},
					"Translation": {
						"Text": "{Location}空间不足\n需要{RequiredBytes}。\n{AvailableBytes}可用。\n你需要额外{SpaceAdditional} 以执行安装。"
					},
					"Key": "InstallDirectoryDiskSpace"
				},
				{
					"Source": {
						"Text": "There is not enough space on your device.\n{RequiredBytes} is required.\n{AvailableBytes} is available.\nYou need an additional {SpaceAdditional} to perform the installation."
					},
					"Translation": {
						"Text": "设备空间不足。\n需要{RequiredBytes}。\n{AvailableBytes}可用。\n你需要额外{SpaceAdditional}以执行安装。"
					},
					"Key": "InstallDirectoryDiskSpaceDevice"
				},
				{
					"Source": {
						"Text": "This installation could not continue as the required decryption data is missing. Please contact support."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "MissingEncryptionKeyForNonPreload"
				},
				{
					"Source": {
						"Text": "This installation could not continue as the required decryption data is not valid. Please contact support."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "InvalidEncryptionKeyForNonPreload"
				},
				{
					"Source": {
						"Text": "This installation could not continue due to a configuration issue. Please contact support."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "EmptyCloudDirectories"
				},
				{
					"Source": {
						"Text": "This installation could not continue due to a configuration issue. Please contact support."
					},
					"Translation": {
						"Text": "因配置问题此安装无法继续。请联系客服。"
					},
					"Key": "InvalidInstallTags"
				},
				{
					"Source": {
						"Text": "This installation could not continue due to a configuration issue. Please contact support."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "InvalidInstallToMemory"
				},
				{
					"Source": {
						"Text": "This installation could not continue due to a configuration issue. Please contact support."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "InvalidMemoryConstructionConfig"
				},
				{
					"Source": {
						"Text": "This installation could not continue due to a configuration issue. Please contact support."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "VerifyOnlyActionMixed"
				},
				{
					"Source": {
						"Text": "This installation could not continue due to a prerequisite configuration issue. Please contact support."
					},
					"Translation": {
						"Text": "由于配置不符合先决条件，安装无法继续。请联系客服。"
					},
					"Key": "MissingPrereqForPrereqOnlyInstall"
				},
				{
					"Source": {
						"Text": "User cancelled."
					},
					"Translation": {
						"Text": "用户取消请求。"
					},
					"Key": "BuildPatchInstallShortError_UserCanceled"
				}
			]
		},
		{
			"Namespace": "BuildPatchInstallProgress",
			"Children": [
				{
					"Source": {
						"Text": "Cleaning up"
					},
					"Translation": {
						"Text": "清理"
					},
					"Key": "EBuildPatchProgress_CleanUp"
				},
				{
					"Source": {
						"Text": "Complete"
					},
					"Translation": {
						"Text": "完成"
					},
					"Key": "EBuildPatchProgress_Complete"
				},
				{
					"Source": {
						"Text": "Downloading"
					},
					"Translation": {
						"Text": "下载中"
					},
					"Key": "EBuildPatchProgress_Downloading"
				},
				{
					"Source": {
						"Text": "Initializing"
					},
					"Translation": {
						"Text": "初始化"
					},
					"Key": "EBuildPatchProgress_Initialising"
				},
				{
					"Source": {
						"Text": "Installing"
					},
					"Translation": {
						"Text": "安装"
					},
					"Key": "EBuildPatchProgress_Installing"
				},
				{
					"Source": {
						"Text": "Paused"
					},
					"Translation": {
						"Text": "暂停"
					},
					"Key": "EBuildPatchProgress_Paused"
				},
				{
					"Source": {
						"Text": "Prerequisites"
					},
					"Translation": {
						"Text": "先决条件"
					},
					"Key": "EBuildPatchProgress_PrerequisitesInstall"
				},
				{
					"Source": {
						"Text": "Queued"
					},
					"Translation": {
						"Text": "排队"
					},
					"Key": "EBuildPatchProgress_Queued"
				},
				{
					"Source": {
						"Text": "Resuming"
					},
					"Translation": {
						"Text": "恢复"
					},
					"Key": "EBuildPatchProgress_Resuming"
				},
				{
					"Source": {
						"Text": "Verifying"
					},
					"Translation": {
						"Text": "验证"
					},
					"Key": "EBuildPatchProgress_BuildVerification"
				}
			]
		},
		{
			"Namespace": "BuildPatchInstaller",
			"Children": [
				{
					"Source": {
						"Text": "Please Wait"
					},
					"Translation": {
						"Text": "请等待"
					},
					"Key": "BuildPatchInstaller_GenericProgress"
				},
				{
					"Source": {
						"Text": "{Current} / {Total} ({Speed}/sec)"
					},
					"Translation": {
						"Text": "{Current}/{Total}({Speed}/秒)"
					},
					"Key": "BuildPatchInstaller_DownloadSpeedFormat"
				}
			]
		},
		{
			"Namespace": "DynamicRHI",
			"Children": [
				{
					"Source": {
						"Text": "NullDrv failure?"
					},
					"Translation": {
						"Text": "NullDrv错误？"
					},
					"Key": "NullDrvFailure"
				}
			]
		},
		{
			"Namespace": "GenericPlatform",
			"Children": [
				{
					"Source": {
						"Text": "File Manager"
					},
					"Translation": {
						"Text": "文件管理器"
					},
					"Key": "FileManagerName"
				}
			]
		},
		{
			"Namespace": "InputKeys",
			"Children": [
				{
					"Source": {
						"Text": "Acceleration"
					},
					"Translation": {
						"Text": "加速键"
					},
					"Key": "Acceleration"
				},
				{
					"Source": {
						"Text": "Ampersand"
					},
					"Translation": {
						"Text": "&"
					},
					"Key": "Ampersand"
				},
				{
					"Source": {
						"Text": "Android"
					},
					"Translation": {
						"Text": "安卓"
					},
					"Key": "AndroidSubCateogry"
				},
				{
					"Source": {
						"Text": "Android Back"
					},
					"Translation": {
						"Text": "安卓 后退键"
					},
					"Key": "Android_Back"
				},
				{
					"Source": {
						"Text": "Android Menu"
					},
					"Translation": {
						"Text": "安卓 菜单键"
					},
					"Key": "Android_Menu"
				},
				{
					"Source": {
						"Text": "Android Volume Down"
					},
					"Translation": {
						"Text": "安卓 音量降低"
					},
					"Key": "Android_Volume_Down"
				},
				{
					"Source": {
						"Text": "Android Volume Up"
					},
					"Translation": {
						"Text": "安卓 音量增加"
					},
					"Key": "Android_Volume_Up"
				},
				{
					"Source": {
						"Text": "Any Key"
					},
					"Translation": {
						"Text": "任意键"
					},
					"Key": "AnyKey"
				},
				{
					"Source": {
						"Text": "Apostrophe"
					},
					"Translation": {
						"Text": "撇号键”'”"
					},
					"Key": "Apostrophe"
				},
				{
					"Source": {
						"Text": "Asterisk"
					},
					"Translation": {
						"Text": "星号键”*”"
					},
					"Key": "Asterix"
				},
				{
					"Source": {
						"Text": "Backslash"
					},
					"Translation": {
						"Text": "反斜杠”\\”"
					},
					"Key": "Backslash"
				},
				{
					"Source": {
						"Text": "Backspace"
					},
					"Translation": {
						"Text": "退格键”Backspace”"
					},
					"Key": "BackSpace"
				},
				{
					"Source": {
						"Text": "Caps"
					},
					"Translation": {
						"Text": "大写锁定”Caps”"
					},
					"Key": "CapsLockShort"
				},
				{
					"Source": {
						"Text": "Caps Lock"
					},
					"Translation": {
						"Text": "大写锁定”Caps Lock”"
					},
					"Key": "CapsLock"
				},
				{
					"Source": {
						"Text": "Caret"
					},
					"Translation": {
						"Text": "插入记号”^”"
					},
					"Key": "Caret"
				},
				{
					"Source": {
						"Text": "Colon"
					},
					"Translation": {
						"Text": "冒号键”:”"
					},
					"Key": "Colon"
				},
				{
					"Source": {
						"Text": "Comma"
					},
					"Translation": {
						"Text": "逗号键”,”"
					},
					"Key": "Comma"
				},
				{
					"Source": {
						"Text": "Del"
					},
					"Translation": {
						"Text": "删除键”Del”"
					},
					"Key": "DeleteShort"
				},
				{
					"Source": {
						"Text": "Delete"
					},
					"Translation": {
						"Text": "删除键”Delete”"
					},
					"Key": "Delete"
				},
				{
					"Source": {
						"Text": "Dollar"
					},
					"Translation": {
						"Text": "美元符号”$”"
					},
					"Key": "Dollar"
				},
				{
					"Source": {
						"Text": "Down"
					},
					"Translation": {
						"Text": "下方向键"
					},
					"Key": "Down"
				},
				{
					"Source": {
						"Text": "End"
					},
					"Translation": {
						"Text": "End键"
					},
					"Key": "End"
				},
				{
					"Source": {
						"Text": "Enter"
					},
					"Translation": {
						"Text": "回车键”Enter”"
					},
					"Key": "Enter"
				},
				{
					"Source": {
						"Text": "Equals"
					},
					"Translation": {
						"Text": "等号”=”"
					},
					"Key": "Equals"
				},
				{
					"Source": {
						"Text": "Esc"
					},
					"Translation": {
						"Text": "退出键”Esc”"
					},
					"Key": "EscapeShort"
				},
				{
					"Source": {
						"Text": "Escape"
					},
					"Translation": {
						"Text": "退出键”Esc”"
					},
					"Key": "Escape"
				},
				{
					"Source": {
						"Text": "Exclamation"
					},
					"Translation": {
						"Text": "感叹号”!”"
					},
					"Key": "Exclamation"
				},
				{
					"Source": {
						"Text": "F1"
					},
					"Translation": {
						"Text": "F1"
					},
					"Key": "F1"
				},
				{
					"Source": {
						"Text": "F10"
					},
					"Translation": {
						"Text": "F10"
					},
					"Key": "F10"
				},
				{
					"Source": {
						"Text": "F11"
					},
					"Translation": {
						"Text": "F11"
					},
					"Key": "F11"
				},
				{
					"Source": {
						"Text": "F12"
					},
					"Translation": {
						"Text": "F12"
					},
					"Key": "F12"
				},
				{
					"Source": {
						"Text": "F2"
					},
					"Translation": {
						"Text": "F2"
					},
					"Key": "F2"
				},
				{
					"Source": {
						"Text": "F3"
					},
					"Translation": {
						"Text": "F3"
					},
					"Key": "F3"
				},
				{
					"Source": {
						"Text": "F4"
					},
					"Translation": {
						"Text": "F4"
					},
					"Key": "F4"
				},
				{
					"Source": {
						"Text": "F5"
					},
					"Translation": {
						"Text": "F5"
					},
					"Key": "F5"
				},
				{
					"Source": {
						"Text": "F6"
					},
					"Translation": {
						"Text": "F6"
					},
					"Key": "F6"
				},
				{
					"Source": {
						"Text": "F7"
					},
					"Translation": {
						"Text": "F7"
					},
					"Key": "F7"
				},
				{
					"Source": {
						"Text": "F8"
					},
					"Translation": {
						"Text": "F8"
					},
					"Key": "F8"
				},
				{
					"Source": {
						"Text": "F9"
					},
					"Translation": {
						"Text": "F9"
					},
					"Key": "F9"
				},
				{
					"Source": {
						"Text": "Flick"
					},
					"Translation": {
						"Text": "滑动"
					},
					"Key": "Gesture_Flick"
				},
				{
					"Source": {
						"Text": "Fn+Delete"
					},
					"Translation": {
						"Text": "Fn+删除键”Delete”"
					},
					"Key": "ForwardDelete"
				},
				{
					"Source": {
						"Text": "Gamepad"
					},
					"Translation": {
						"Text": "手柄"
					},
					"Key": "GamepadSubCategory"
				},
				{
					"Source": {
						"Text": "Gamepad A"
					},
					"Translation": {
						"Text": "手柄 A"
					},
					"Key": "XBoxOne_Gamepad_FaceButton_Bottom"
				},
				{
					"Source": {
						"Text": "Gamepad B"
					},
					"Translation": {
						"Text": "手柄 B"
					},
					"Key": "XBoxOne_Gamepad_FaceButton_Right"
				},
				{
					"Source": {
						"Text": "Gamepad Back"
					},
					"Translation": {
						"Text": "手柄 后退键"
					},
					"Key": "XBoxOne_Gamepad_Special_Left"
				},
				{
					"Source": {
						"Text": "Gamepad Circle"
					},
					"Translation": {
						"Text": "手柄 圆圈"
					},
					"Key": "PS4_Gamepad_FaceButton_Right"
				},
				{
					"Source": {
						"Text": "Gamepad D-pad Down"
					},
					"Translation": {
						"Text": "手柄 方向键下"
					},
					"Key": "Gamepad_DPad_Down"
				},
				{
					"Source": {
						"Text": "Gamepad D-pad Left"
					},
					"Translation": {
						"Text": "手柄 方向键左"
					},
					"Key": "Gamepad_DPad_Left"
				},
				{
					"Source": {
						"Text": "Gamepad D-pad Right"
					},
					"Translation": {
						"Text": "手柄 方向键右"
					},
					"Key": "Gamepad_DPad_Right"
				},
				{
					"Source": {
						"Text": "Gamepad D-pad Up"
					},
					"Translation": {
						"Text": "手柄 方向键上"
					},
					"Key": "Gamepad_DPad_Up"
				},
				{
					"Source": {
						"Text": "Gamepad Face Button Bottom"
					},
					"Translation": {
						"Text": "手柄 导航键 按钮 下"
					},
					"Key": "Gamepad_FaceButton_Bottom"
				},
				{
					"Source": {
						"Text": "Gamepad Face Button Left"
					},
					"Translation": {
						"Text": "手柄 导航键 按钮 左"
					},
					"Key": "Gamepad_FaceButton_Left"
				},
				{
					"Source": {
						"Text": "Gamepad Face Button Right"
					},
					"Translation": {
						"Text": "手柄 导航键 按钮 右"
					},
					"Key": "Gamepad_FaceButton_Right"
				},
				{
					"Source": {
						"Text": "Gamepad Face Button Top"
					},
					"Translation": {
						"Text": "手柄 导航键 上"
					},
					"Key": "Gamepad_FaceButton_Top"
				},
				{
					"Source": {
						"Text": "Gamepad L1"
					},
					"Translation": {
						"Text": "手柄 L1"
					},
					"Key": "PS4_Gamepad_LeftShoulder"
				},
				{
					"Source": {
						"Text": "Gamepad L2"
					},
					"Translation": {
						"Text": "手柄 L2"
					},
					"Key": "PS4_Gamepad_LeftTrigger"
				},
				{
					"Source": {
						"Text": "Gamepad L2 Axis"
					},
					"Translation": {
						"Text": "手柄 L2 轴"
					},
					"Key": "PS4_Gamepad_LeftTriggerAxis"
				},
				{
					"Source": {
						"Text": "Gamepad L3"
					},
					"Translation": {
						"Text": "手柄 L3"
					},
					"Key": "PS4_Gamepad_LeftThumbstick"
				},
				{
					"Source": {
						"Text": "Gamepad Left Shoulder"
					},
					"Translation": {
						"Text": "手柄 左肩键"
					},
					"Key": "Gamepad_LeftShoulder"
				},
				{
					"Source": {
						"Text": "Gamepad Left Thumbstick 2D-Axis"
					},
					"Translation": {
						"Text": "手柄左摇杆2D轴"
					},
					"Key": "Gamepad_Left2D"
				},
				{
					"Source": {
						"Text": "Gamepad Left Thumbstick Button"
					},
					"Translation": {
						"Text": "手柄 左摇杆按钮"
					},
					"Key": "Gamepad_LeftThumbstick"
				},
				{
					"Source": {
						"Text": "Gamepad Left Thumbstick Down"
					},
					"Translation": {
						"Text": "手柄 左摇杆下"
					},
					"Key": "Gamepad_LeftStick_Down"
				},
				{
					"Source": {
						"Text": "Gamepad Left Thumbstick Left"
					},
					"Translation": {
						"Text": "手柄 左摇杆左"
					},
					"Key": "Gamepad_LeftStick_Left"
				},
				{
					"Source": {
						"Text": "Gamepad Left Thumbstick Right"
					},
					"Translation": {
						"Text": "手柄 左摇杆右"
					},
					"Key": "Gamepad_LeftStick_Right"
				},
				{
					"Source": {
						"Text": "Gamepad Left Thumbstick Up"
					},
					"Translation": {
						"Text": "手柄 左摇杆上"
					},
					"Key": "Gamepad_LeftStick_Up"
				},
				{
					"Source": {
						"Text": "Gamepad Left Thumbstick X-Axis"
					},
					"Translation": {
						"Text": "手柄 左摇杆X-轴"
					},
					"Key": "Gamepad_LeftX"
				},
				{
					"Source": {
						"Text": "Gamepad Left Thumbstick Y-Axis"
					},
					"Translation": {
						"Text": "手柄 左摇杆Y-轴"
					},
					"Key": "Gamepad_LeftY"
				},
				{
					"Source": {
						"Text": "Gamepad Left Trigger"
					},
					"Translation": {
						"Text": "手柄 左扳机"
					},
					"Key": "Gamepad_LeftTrigger"
				},
				{
					"Source": {
						"Text": "Gamepad Left Trigger Axis"
					},
					"Translation": {
						"Text": "手柄 左扳机轴"
					},
					"Key": "Gamepad_LeftTriggerAxis"
				},
				{
					"Source": {
						"Text": "Gamepad Options"
					},
					"Translation": {
						"Text": "手柄 选项键"
					},
					"Key": "PS4_Gamepad_Special_Right"
				},
				{
					"Source": {
						"Text": "Gamepad R1"
					},
					"Translation": {
						"Text": "手柄 R1"
					},
					"Key": "PS4_Gamepad_RightShoulder"
				},
				{
					"Source": {
						"Text": "Gamepad R2"
					},
					"Translation": {
						"Text": "手柄 R2"
					},
					"Key": "PS4_Gamepad_RightTrigger"
				},
				{
					"Source": {
						"Text": "Gamepad R2 Axis"
					},
					"Translation": {
						"Text": "手柄 R2 轴"
					},
					"Key": "PS4_Gamepad_RightTriggerAxis"
				},
				{
					"Source": {
						"Text": "Gamepad R3"
					},
					"Translation": {
						"Text": "手柄 R3"
					},
					"Key": "PS4_Gamepad_RightThumbstick"
				},
				{
					"Source": {
						"Text": "Gamepad Right Shoulder"
					},
					"Translation": {
						"Text": "手柄 右肩键"
					},
					"Key": "Gamepad_RightShoulder"
				},
				{
					"Source": {
						"Text": "Gamepad Right Thumbstick 2D-Axis"
					},
					"Translation": {
						"Text": "手柄右摇杆2D轴"
					},
					"Key": "Gamepad_Right2D"
				},
				{
					"Source": {
						"Text": "Gamepad Right Thumbstick Button"
					},
					"Translation": {
						"Text": "手柄 右摇杆按钮"
					},
					"Key": "Gamepad_RightThumbstick"
				},
				{
					"Source": {
						"Text": "Gamepad Right Thumbstick Down"
					},
					"Translation": {
						"Text": "手柄 右摇杆下"
					},
					"Key": "Gamepad_RightStick_Down"
				},
				{
					"Source": {
						"Text": "Gamepad Right Thumbstick Left"
					},
					"Translation": {
						"Text": "手柄 右摇杆左"
					},
					"Key": "Gamepad_RightStick_Left"
				},
				{
					"Source": {
						"Text": "Gamepad Right Thumbstick Right"
					},
					"Translation": {
						"Text": "手柄 右摇杆右"
					},
					"Key": "Gamepad_RightStick_Right"
				},
				{
					"Source": {
						"Text": "Gamepad Right Thumbstick Up"
					},
					"Translation": {
						"Text": "手柄 右摇杆上"
					},
					"Key": "Gamepad_RightStick_Up"
				},
				{
					"Source": {
						"Text": "Gamepad Right Thumbstick X-Axis"
					},
					"Translation": {
						"Text": "手柄 右摇杆X-轴"
					},
					"Key": "Gamepad_RightX"
				},
				{
					"Source": {
						"Text": "Gamepad Right Thumbstick Y-Axis"
					},
					"Translation": {
						"Text": "手柄 右摇杆Y-轴"
					},
					"Key": "Gamepad_RightY"
				},
				{
					"Source": {
						"Text": "Gamepad Right Trigger"
					},
					"Translation": {
						"Text": "手柄 右扳机"
					},
					"Key": "Gamepad_RightTrigger"
				},
				{
					"Source": {
						"Text": "Gamepad Right Trigger Axis"
					},
					"Translation": {
						"Text": "手柄 右扳机轴"
					},
					"Key": "Gamepad_RightTriggerAxis"
				},
				{
					"Source": {
						"Text": "Gamepad Special Left"
					},
					"Translation": {
						"Text": "手柄 特殊键 左"
					},
					"Key": "Gamepad_Special_Left"
				},
				{
					"Source": {
						"Text": "Gamepad Special Right"
					},
					"Translation": {
						"Text": "手柄 特殊键 右"
					},
					"Key": "Gamepad_Special_Right"
				},
				{
					"Source": {
						"Text": "Gamepad Square"
					},
					"Translation": {
						"Text": "手柄 方块"
					},
					"Key": "PS4_Gamepad_FaceButton_Left"
				},
				{
					"Source": {
						"Text": "Gamepad Start"
					},
					"Translation": {
						"Text": "手柄 开始键"
					},
					"Key": "XBoxOne_Gamepad_Special_Right"
				},
				{
					"Source": {
						"Text": "Gamepad Touchpad Button"
					},
					"Translation": {
						"Text": "手柄 触摸板"
					},
					"Key": "PS4_Gamepad_Special_Left"
				},
				{
					"Source": {
						"Text": "Gamepad Touchpad Touched"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "PS4_Gamepad_Special_Left_Touched"
				},
				{
					"Source": {
						"Text": "Gamepad Triangle"
					},
					"Translation": {
						"Text": "手柄 三角"
					},
					"Key": "PS4_Gamepad_FaceButton_Top"
				},
				{
					"Source": {
						"Text": "Gamepad X"
					},
					"Translation": {
						"Text": "手柄 交叉"
					},
					"Key": "PS4_Gamepad_FaceButton_Bottom"
				},
				{
					"Source": {
						"Text": "Gamepad X"
					},
					"Translation": {
						"Text": "手柄 交叉"
					},
					"Key": "XBoxOne_Gamepad_FaceButton_Left"
				},
				{
					"Source": {
						"Text": "Gamepad Y"
					},
					"Translation": {
						"Text": "手柄 Y"
					},
					"Key": "XBoxOne_Gamepad_FaceButton_Top"
				},
				{
					"Source": {
						"Text": "Gesture"
					},
					"Translation": {
						"Text": "手势"
					},
					"Key": "GestureSubCateogry"
				},
				{
					"Source": {
						"Text": "Global Back"
					},
					"Translation": {
						"Text": "全局后退"
					},
					"Key": "Global_Back"
				},
				{
					"Source": {
						"Text": "Global Menu"
					},
					"Translation": {
						"Text": "全局菜单"
					},
					"Key": "Global_Menu"
				},
				{
					"Source": {
						"Text": "Global Pause"
					},
					"Translation": {
						"Text": "全局暂停"
					},
					"Key": "Global_Pause"
				},
				{
					"Source": {
						"Text": "Global Play"
					},
					"Translation": {
						"Text": "全局播放"
					},
					"Key": "Global_Play"
				},
				{
					"Source": {
						"Text": "Global View"
					},
					"Translation": {
						"Text": "全局观察"
					},
					"Key": "Global_View"
				},
				{
					"Source": {
						"Text": "Gravity"
					},
					"Translation": {
						"Text": "重力"
					},
					"Key": "Gravity"
				},
				{
					"Source": {
						"Text": "HTC Vive"
					},
					"Translation": {
						"Text": "HTC Vive"
					},
					"Key": "ViveSubCategory"
				},
				{
					"Source": {
						"Text": "Home"
					},
					"Translation": {
						"Text": "主页"
					},
					"Key": "Home"
				},
				{
					"Source": {
						"Text": "Hyphen"
					},
					"Translation": {
						"Text": "连字符”-”"
					},
					"Key": "Hyphen"
				},
				{
					"Source": {
						"Text": "Ins"
					},
					"Translation": {
						"Text": "插入键”Ins”"
					},
					"Key": "InsertShort"
				},
				{
					"Source": {
						"Text": "Insert"
					},
					"Translation": {
						"Text": "插入键”Insert”"
					},
					"Key": "Insert"
				},
				{
					"Source": {
						"Text": "Keyboard"
					},
					"Translation": {
						"Text": "键盘"
					},
					"Key": "KeyboardSubCategory"
				},
				{
					"Source": {
						"Text": "LMB"
					},
					"Translation": {
						"Text": "LMB"
					},
					"Key": "LeftMouseButtonShort"
				},
				{
					"Source": {
						"Text": "Left"
					},
					"Translation": {
						"Text": "左方向键"
					},
					"Key": "Left"
				},
				{
					"Source": {
						"Text": "Left Alt"
					},
					"Translation": {
						"Text": "左Alt键"
					},
					"Key": "LeftAlt"
				},
				{
					"Source": {
						"Text": "Left Bracket"
					},
					"Translation": {
						"Text": "左方括号”[”"
					},
					"Key": "LeftBracket"
				},
				{
					"Source": {
						"Text": "Left Cmd"
					},
					"Translation": {
						"Text": "左Cmd键"
					},
					"Key": "LeftCommand"
				},
				{
					"Source": {
						"Text": "Left Ctrl"
					},
					"Translation": {
						"Text": "左Ctrl键"
					},
					"Key": "LeftControl"
				},
				{
					"Source": {
						"Text": "Left Mouse Button"
					},
					"Translation": {
						"Text": "鼠标左键"
					},
					"Key": "LeftMouseButton"
				},
				{
					"Source": {
						"Text": "Left Parantheses"
					},
					"Translation": {
						"Text": "左圆括号”(”"
					},
					"Key": "LeftParantheses"
				},
				{
					"Source": {
						"Text": "Left Shift"
					},
					"Translation": {
						"Text": "左Shift键"
					},
					"Key": "LeftShift"
				},
				{
					"Source": {
						"Text": "Long Press"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "Gesture_LongPress"
				},
				{
					"Source": {
						"Text": "Middle Mouse Button"
					},
					"Translation": {
						"Text": "鼠标中键"
					},
					"Key": "MiddleMouseButton"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Grip"
					},
					"Translation": {
						"Text": "Mixed Reality（左）抓握"
					},
					"Key": "MixedReality_Left_Grip_Click"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Menu"
					},
					"Translation": {
						"Text": "Mixed Reality（左）菜单"
					},
					"Key": "MixedReality_Left_Menu_Click"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Thumbstick 2D-Axis"
					},
					"Translation": {
						"Text": "Mixed Reality（左）摇杆 2D 轴"
					},
					"Key": "MixedReality_Left_Thumbstick_2D"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Thumbstick Button"
					},
					"Translation": {
						"Text": "Mixed Reality（左）摇杆按键"
					},
					"Key": "MixedReality_Left_Thumbstick_Click"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Thumbstick Down"
					},
					"Translation": {
						"Text": "Mixed Reality（左）摇杆下"
					},
					"Key": "MixedReality_Left_Thumbstick_Down"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Thumbstick Left"
					},
					"Translation": {
						"Text": "Mixed Reality（左）摇杆左"
					},
					"Key": "MixedReality_Left_Thumbstick_Left"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Thumbstick Right"
					},
					"Translation": {
						"Text": "Mixed Reality（左）摇杆右"
					},
					"Key": "MixedReality_Left_Thumbstick_Right"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Thumbstick Up"
					},
					"Translation": {
						"Text": "Mixed Reality（左）摇杆上"
					},
					"Key": "MixedReality_Left_Thumbstick_Up"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Thumbstick X-Axis"
					},
					"Translation": {
						"Text": "Mixed Reality（左）摇杆 X 轴"
					},
					"Key": "MixedReality_Left_Thumbstick_X"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Thumbstick Y-Axis"
					},
					"Translation": {
						"Text": "Mixed Reality（左）摇杆 Y 轴"
					},
					"Key": "MixedReality_Left_Thumbstick_Y"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Trackpad 2D-Axis"
					},
					"Translation": {
						"Text": "Mixed Reality（左）触控板 2D 轴"
					},
					"Key": "MixedReality_Left_Trackpad_2D"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Trackpad Button"
					},
					"Translation": {
						"Text": "Mixed Reality（左）触控板按键"
					},
					"Key": "MixedReality_Left_Trackpad_Click"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Trackpad Down"
					},
					"Translation": {
						"Text": "Mixed Reality（左）触控板下"
					},
					"Key": "MixedReality_Left_Trackpad_Down"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Trackpad Left"
					},
					"Translation": {
						"Text": "Mixed Reality（左）触控板左"
					},
					"Key": "MixedReality_Left_Trackpad_Left"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Trackpad Right"
					},
					"Translation": {
						"Text": "Mixed Reality（左）触控板右"
					},
					"Key": "MixedReality_Left_Trackpad_Right"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Trackpad Touch"
					},
					"Translation": {
						"Text": "Mixed Reality（左）触控板轻触"
					},
					"Key": "MixedReality_Left_Trackpad_Touch"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Trackpad Up"
					},
					"Translation": {
						"Text": "Mixed Reality（左）触控板上"
					},
					"Key": "MixedReality_Left_Trackpad_Up"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Trackpad X"
					},
					"Translation": {
						"Text": "Mixed Reality（左）触控板X"
					},
					"Key": "MixedReality_Left_Trackpad_X"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Trackpad Y"
					},
					"Translation": {
						"Text": "Mixed Reality（左）触控板Y"
					},
					"Key": "MixedReality_Left_Trackpad_Y"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Trigger"
					},
					"Translation": {
						"Text": "Mixed Reality（左）扳机"
					},
					"Key": "MixedReality_Left_Trigger_Click"
				},
				{
					"Source": {
						"Text": "Mixed Reality (L) Trigger Axis"
					},
					"Translation": {
						"Text": "Mixed Reality（左）扳机轴"
					},
					"Key": "MixedReality_Left_Trigger_Axis"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Grip"
					},
					"Translation": {
						"Text": "Mixed Reality（右）抓握"
					},
					"Key": "MixedReality_Right_Grip_Click"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Menu"
					},
					"Translation": {
						"Text": "Mixed Reality（右）菜单"
					},
					"Key": "MixedReality_Right_Menu_Click"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Thumbstick 2D-Axis"
					},
					"Translation": {
						"Text": "Mixed Reality（右）摇杆 2D 轴"
					},
					"Key": "MixedReality_Right_Thumbstick_2D"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Thumbstick Button"
					},
					"Translation": {
						"Text": "Mixed Reality（右）摇杆按键"
					},
					"Key": "MixedReality_Right_Thumbstick_Click"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Thumbstick Down"
					},
					"Translation": {
						"Text": "Mixed Reality（右）摇杆下"
					},
					"Key": "MixedReality_Right_Thumbstick_Down"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Thumbstick Left"
					},
					"Translation": {
						"Text": "Mixed Reality（右）摇杆左"
					},
					"Key": "MixedReality_Right_Thumbstick_Left"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Thumbstick Right"
					},
					"Translation": {
						"Text": "Mixed Reality（右）摇杆右"
					},
					"Key": "MixedReality_Right_Thumbstick_Right"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Thumbstick Up"
					},
					"Translation": {
						"Text": "Mixed Reality（右）摇杆上"
					},
					"Key": "MixedReality_Right_Thumbstick_Up"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Thumbstick X-Axis"
					},
					"Translation": {
						"Text": "Mixed Reality（右）摇杆 X 轴"
					},
					"Key": "MixedReality_Right_Thumbstick_X"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Thumbstick Y-Axis"
					},
					"Translation": {
						"Text": "Mixed Reality（右）摇杆 Y 轴"
					},
					"Key": "MixedReality_Right_Thumbstick_Y"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Trackpad 2D-Axis"
					},
					"Translation": {
						"Text": "Mixed Reality（右）触控板 2D 轴"
					},
					"Key": "MixedReality_Right_Trackpad_2D"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Trackpad Button"
					},
					"Translation": {
						"Text": "Mixed Reality（右）触控板按键"
					},
					"Key": "MixedReality_Right_Trackpad_Click"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Trackpad Down"
					},
					"Translation": {
						"Text": "Mixed Reality（右）触控板下"
					},
					"Key": "MixedReality_Right_Trackpad_Down"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Trackpad Left"
					},
					"Translation": {
						"Text": "Mixed Reality（右）触控板左"
					},
					"Key": "MixedReality_Right_Trackpad_Left"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Trackpad Right"
					},
					"Translation": {
						"Text": "Mixed Reality（右）触控板右"
					},
					"Key": "MixedReality_Right_Trackpad_Right"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Trackpad Touch"
					},
					"Translation": {
						"Text": "Mixed Reality（右）触控板 Touch"
					},
					"Key": "MixedReality_Right_Trackpad_Touch"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Trackpad Up"
					},
					"Translation": {
						"Text": "Mixed Reality（右）触控板上"
					},
					"Key": "MixedReality_Right_Trackpad_Up"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Trackpad X"
					},
					"Translation": {
						"Text": "Mixed Reality（右）触控板 X"
					},
					"Key": "MixedReality_Right_Trackpad_X"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Trackpad Y"
					},
					"Translation": {
						"Text": "Mixed Reality（右）触控板 Y"
					},
					"Key": "MixedReality_Right_Trackpad_Y"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Trigger"
					},
					"Translation": {
						"Text": "Mixed Reality（右）扳机"
					},
					"Key": "MixedReality_Right_Trigger_Click"
				},
				{
					"Source": {
						"Text": "Mixed Reality (R) Trigger Axis"
					},
					"Translation": {
						"Text": "Mixed Reality（右）扳机轴"
					},
					"Key": "MixedReality_Right_Trigger_Axis"
				},
				{
					"Source": {
						"Text": "Motion"
					},
					"Translation": {
						"Text": "动作"
					},
					"Key": "MotionSubCateogry"
				},
				{
					"Source": {
						"Text": "Mouse"
					},
					"Translation": {
						"Text": "鼠标"
					},
					"Key": "MouseSubCategory"
				},
				{
					"Source": {
						"Text": "Mouse Wheel Axis"
					},
					"Translation": {
						"Text": "鼠标滚轮轴"
					},
					"Key": "MouseWheelAxis"
				},
				{
					"Source": {
						"Text": "Mouse Wheel Down"
					},
					"Translation": {
						"Text": "向下滚动鼠标滚轮"
					},
					"Key": "MouseScrollDown"
				},
				{
					"Source": {
						"Text": "Mouse Wheel Up"
					},
					"Translation": {
						"Text": "向上滚动鼠标滚轮"
					},
					"Key": "MouseScrollUp"
				},
				{
					"Source": {
						"Text": "Mouse X"
					},
					"Translation": {
						"Text": "鼠标X"
					},
					"Key": "MouseX"
				},
				{
					"Source": {
						"Text": "Mouse XY 2D-Axis"
					},
					"Translation": {
						"Text": "鼠标XY 2D轴"
					},
					"Key": "Mouse2D"
				},
				{
					"Source": {
						"Text": "Mouse Y"
					},
					"Translation": {
						"Text": "鼠标Y"
					},
					"Key": "MouseY"
				},
				{
					"Source": {
						"Text": "Num *"
					},
					"Translation": {
						"Text": "数字键*"
					},
					"Key": "Multiply"
				},
				{
					"Source": {
						"Text": "Num +"
					},
					"Translation": {
						"Text": "数字键+"
					},
					"Key": "Add"
				},
				{
					"Source": {
						"Text": "Num -"
					},
					"Translation": {
						"Text": "数字键-"
					},
					"Key": "Subtract"
				},
				{
					"Source": {
						"Text": "Num ."
					},
					"Translation": {
						"Text": "数字键."
					},
					"Key": "Decimal"
				},
				{
					"Source": {
						"Text": "Num /"
					},
					"Translation": {
						"Text": "数字键/"
					},
					"Key": "Divide"
				},
				{
					"Source": {
						"Text": "Num 0"
					},
					"Translation": {
						"Text": "数字键0"
					},
					"Key": "NumPadZero"
				},
				{
					"Source": {
						"Text": "Num 1"
					},
					"Translation": {
						"Text": "数字键1"
					},
					"Key": "NumPadOne"
				},
				{
					"Source": {
						"Text": "Num 2"
					},
					"Translation": {
						"Text": "数字键2"
					},
					"Key": "NumPadTwo"
				},
				{
					"Source": {
						"Text": "Num 3"
					},
					"Translation": {
						"Text": "数字键3"
					},
					"Key": "NumPadThree"
				},
				{
					"Source": {
						"Text": "Num 4"
					},
					"Translation": {
						"Text": "数字键4"
					},
					"Key": "NumPadFour"
				},
				{
					"Source": {
						"Text": "Num 5"
					},
					"Translation": {
						"Text": "数字键5"
					},
					"Key": "NumPadFive"
				},
				{
					"Source": {
						"Text": "Num 6"
					},
					"Translation": {
						"Text": "数字键6"
					},
					"Key": "NumPadSix"
				},
				{
					"Source": {
						"Text": "Num 7"
					},
					"Translation": {
						"Text": "数字键7"
					},
					"Key": "NumPadSeven"
				},
				{
					"Source": {
						"Text": "Num 8"
					},
					"Translation": {
						"Text": "数字键8"
					},
					"Key": "NumPadEight"
				},
				{
					"Source": {
						"Text": "Num 9"
					},
					"Translation": {
						"Text": "数字键9"
					},
					"Key": "NumPadNine"
				},
				{
					"Source": {
						"Text": "Num Lock"
					},
					"Translation": {
						"Text": "数字键锁定”Num Lock”"
					},
					"Key": "NumLock"
				},
				{
					"Source": {
						"Text": "Oculus Touch"
					},
					"Translation": {
						"Text": "Oculus Touch"
					},
					"Key": "OculusTouchSubCategory"
				},
				{
					"Source": {
						"Text": "Oculus Touch (L) Grip"
					},
					"Translation": {
						"Text": "Oculus Touch（左）抓握"
					},
					"Key": "OculusTouch_Left_Grip_Click"
				},
				{
					"Source": {
						"Text": "Oculus Touch (L) Grip Axis"
					},
					"Translation": {
						"Text": "Oculus Touch（左）抓握轴"
					},
					"Key": "OculusTouch_Left_Grip_Axis"
				},
				{
					"Source": {
						"Text": "Oculus Touch (L) Menu"
					},
					"Translation": {
						"Text": "Oculus Touch（左）菜单"
					},
					"Key": "OculusTouch_Left_Menu_Click"
				},
				{
					"Source": {
						"Text": "Oculus Touch (L) Thumbstick 2D-Axis"
					},
					"Translation": {
						"Text": "Oculus Touch（左）摇杆 2D 轴"
					},
					"Key": "OculusTouch_Left_Thumbstick_2D"
				},
				{
					"Source": {
						"Text": "Oculus Touch (L) Thumbstick Button"
					},
					"Translation": {
						"Text": "Oculus Touch（左）摇杆按键"
					},
					"Key": "OculusTouch_Left_Thumbstick_Click"
				},
				{
					"Source": {
						"Text": "Oculus Touch (L) Thumbstick Down"
					},
					"Translation": {
						"Text": "Oculus Touch（左）摇杆下"
					},
					"Key": "OculusTouch_Left_Thumbstick_Down"
				},
				{
					"Source": {
						"Text": "Oculus Touch (L) Thumbstick Left"
					},
					"Translation": {
						"Text": "Oculus Touch（左）摇杆左"
					},
					"Key": "OculusTouch_Left_Thumbstick_Left"
				},
				{
					"Source": {
						"Text": "Oculus Touch (L) Thumbstick Right"
					},
					"Translation": {
						"Text": "Oculus Touch（左）摇杆右"
					},
					"Key": "OculusTouch_Left_Thumbstick_Right"
				},
				{
					"Source": {
						"Text": "Oculus Touch (L) Thumbstick Touch"
					},
					"Translation": {
						"Text": "Oculus Touch（左）摇杆轻触"
					},
					"Key": "OculusTouch_Left_Thumbstick_Touch"
				},
				{
					"Source": {
						"Text": "Oculus Touch (L) Thumbstick Up"
					},
					"Translation": {
						"Text": "Oculus Touch（左）摇杆上"
					},
					"Key": "OculusTouch_Left_Thumbstick_Up"
				},
				{
					"Source": {
						"Text": "Oculus Touch (L) Thumbstick X-Axis"
					},
					"Translation": {
						"Text": "Oculus Touch（左）摇杆 X 轴"
					},
					"Key": "OculusTouch_Left_Thumbstick_X"
				},
				{
					"Source": {
						"Text": "Oculus Touch (L) Thumbstick Y-Axis"
					},
					"Translation": {
						"Text": "Oculus Touch（左）摇杆 Y 轴"
					},
					"Key": "OculusTouch_Left_Thumbstick_Y"
				},
				{
					"Source": {
						"Text": "Oculus Touch (L) Trigger"
					},
					"Translation": {
						"Text": "Oculus Touch（左）扳机"
					},
					"Key": "OculusTouch_Left_Trigger_Click"
				},
				{
					"Source": {
						"Text": "Oculus Touch (L) Trigger Axis"
					},
					"Translation": {
						"Text": "Oculus Touch（左）扳机轴"
					},
					"Key": "OculusTouch_Left_Trigger_Axis"
				},
				{
					"Source": {
						"Text": "Oculus Touch (L) Trigger Touch"
					},
					"Translation": {
						"Text": "Oculus Touch（左）扳机轻触"
					},
					"Key": "OculusTouch_Left_Trigger_Touch"
				},
				{
					"Source": {
						"Text": "Oculus Touch (L) X Press"
					},
					"Translation": {
						"Text": "Oculus Touch（左）X点按"
					},
					"Key": "OculusTouch_Left_X_Click"
				},
				{
					"Source": {
						"Text": "Oculus Touch (L) X Touch"
					},
					"Translation": {
						"Text": "Oculus Touch（左）X轻触"
					},
					"Key": "OculusTouch_Left_X_Touch"
				},
				{
					"Source": {
						"Text": "Oculus Touch (L) Y Press"
					},
					"Translation": {
						"Text": "Oculus Touch（左）Y点按"
					},
					"Key": "OculusTouch_Left_Y_Click"
				},
				{
					"Source": {
						"Text": "Oculus Touch (L) Y Touch"
					},
					"Translation": {
						"Text": "Oculus Touch（左）Y轻触"
					},
					"Key": "OculusTouch_Left_Y_Touch"
				},
				{
					"Source": {
						"Text": "Oculus Touch (R) A Press"
					},
					"Translation": {
						"Text": "Oculus Touch（右）A点按"
					},
					"Key": "OculusTouch_Right_A_Click"
				},
				{
					"Source": {
						"Text": "Oculus Touch (R) A Touch"
					},
					"Translation": {
						"Text": "Oculus Touch（右）A轻触"
					},
					"Key": "OculusTouch_Right_A_Touch"
				},
				{
					"Source": {
						"Text": "Oculus Touch (R) B Press"
					},
					"Translation": {
						"Text": "Oculus Touch（右）B点按"
					},
					"Key": "OculusTouch_Right_B_Click"
				},
				{
					"Source": {
						"Text": "Oculus Touch (R) B Touch"
					},
					"Translation": {
						"Text": "Oculus Touch（右）B轻触"
					},
					"Key": "OculusTouch_Right_B_Touch"
				},
				{
					"Source": {
						"Text": "Oculus Touch (R) Grip"
					},
					"Translation": {
						"Text": "Oculus Touch（右）抓握"
					},
					"Key": "OculusTouch_Right_Grip_Click"
				},
				{
					"Source": {
						"Text": "Oculus Touch (R) Grip Axis"
					},
					"Translation": {
						"Text": "Oculus Touch（右）抓握轴"
					},
					"Key": "OculusTouch_Right_Grip_Axis"
				},
				{
					"Source": {
						"Text": "Oculus Touch (R) Thumbstick 2D-Axis"
					},
					"Translation": {
						"Text": "Oculus Touch（右）摇杆 2D 轴"
					},
					"Key": "OculusTouch_Right_Thumbstick_2D"
				},
				{
					"Source": {
						"Text": "Oculus Touch (R) Thumbstick Button"
					},
					"Translation": {
						"Text": "Oculus Touch（右）摇杆按键"
					},
					"Key": "OculusTouch_Right_Thumbstick_Click"
				},
				{
					"Source": {
						"Text": "Oculus Touch (R) Thumbstick Down"
					},
					"Translation": {
						"Text": "Oculus Touch（右）摇杆下"
					},
					"Key": "OculusTouch_Right_Thumbstick_Down"
				},
				{
					"Source": {
						"Text": "Oculus Touch (R) Thumbstick Left"
					},
					"Translation": {
						"Text": "Oculus Touch（右）摇杆左"
					},
					"Key": "OculusTouch_Right_Thumbstick_Left"
				},
				{
					"Source": {
						"Text": "Oculus Touch (R) Thumbstick Right"
					},
					"Translation": {
						"Text": "Oculus Touch（右）摇杆右"
					},
					"Key": "OculusTouch_Right_Thumbstick_Right"
				},
				{
					"Source": {
						"Text": "Oculus Touch (R) Thumbstick Touch"
					},
					"Translation": {
						"Text": "Oculus Touch（右）摇杆轻触"
					},
					"Key": "OculusTouch_Right_Thumbstick_Touch"
				},
				{
					"Source": {
						"Text": "Oculus Touch (R) Thumbstick Up"
					},
					"Translation": {
						"Text": "Oculus Touch（右）摇杆上"
					},
					"Key": "OculusTouch_Right_Thumbstick_Up"
				},
				{
					"Source": {
						"Text": "Oculus Touch (R) Thumbstick X-Axis"
					},
					"Translation": {
						"Text": "Oculus Touch（右）摇杆 X 轴"
					},
					"Key": "OculusTouch_Right_Thumbstick_X"
				},
				{
					"Source": {
						"Text": "Oculus Touch (R) Thumbstick Y-Axis"
					},
					"Translation": {
						"Text": "Oculus Touch（右）摇杆 Y 轴"
					},
					"Key": "OculusTouch_Right_Thumbstick_Y"
				},
				{
					"Source": {
						"Text": "Oculus Touch (R) Trigger"
					},
					"Translation": {
						"Text": "Oculus Touch（右）扳机"
					},
					"Key": "OculusTouch_Right_Trigger_Click"
				},
				{
					"Source": {
						"Text": "Oculus Touch (R) Trigger Axis"
					},
					"Translation": {
						"Text": "Oculus Touch（右）扳机轴"
					},
					"Key": "OculusTouch_Right_Trigger_Axis"
				},
				{
					"Source": {
						"Text": "Oculus Touch (R) Trigger Touch"
					},
					"Translation": {
						"Text": "Oculus Touch（右）扳机轻触"
					},
					"Key": "OculusTouch_Right_Trigger_Touch"
				},
				{
					"Source": {
						"Text": "Page Down"
					},
					"Translation": {
						"Text": "向下翻页”Page down”"
					},
					"Key": "PageDown"
				},
				{
					"Source": {
						"Text": "Page Up"
					},
					"Translation": {
						"Text": "向上翻页”Page up”"
					},
					"Key": "PageUp"
				},
				{
					"Source": {
						"Text": "Pan"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "Gesture_Pan"
				},
				{
					"Source": {
						"Text": "Pause"
					},
					"Translation": {
						"Text": "暂停键”Pause”"
					},
					"Key": "Pause"
				},
				{
					"Source": {
						"Text": "Period"
					},
					"Translation": {
						"Text": "句号键”.”"
					},
					"Key": "Period"
				},
				{
					"Source": {
						"Text": "PgDn"
					},
					"Translation": {
						"Text": "向下翻页”PgDn”"
					},
					"Key": "PageDownShort"
				},
				{
					"Source": {
						"Text": "PgUp"
					},
					"Translation": {
						"Text": "向上翻页”PgUp”"
					},
					"Key": "PageUpShort"
				},
				{
					"Source": {
						"Text": "Pinch"
					},
					"Translation": {
						"Text": "捏合"
					},
					"Key": "Gesture_Pinch"
				},
				{
					"Source": {
						"Text": "Quote"
					},
					"Translation": {
						"Text": "引号”””"
					},
					"Key": "Quote"
				},
				{
					"Source": {
						"Text": "RMB"
					},
					"Translation": {
						"Text": "RMB"
					},
					"Key": "RightMouseButtonShort"
				},
				{
					"Source": {
						"Text": "Right"
					},
					"Translation": {
						"Text": "右方向键"
					},
					"Key": "Right"
				},
				{
					"Source": {
						"Text": "Right Alt"
					},
					"Translation": {
						"Text": "右Alt键"
					},
					"Key": "RightAlt"
				},
				{
					"Source": {
						"Text": "Right Bracket"
					},
					"Translation": {
						"Text": "右方括号”]”"
					},
					"Key": "RightBracket"
				},
				{
					"Source": {
						"Text": "Right Cmd"
					},
					"Translation": {
						"Text": "右Cmd键"
					},
					"Key": "RightCommand"
				},
				{
					"Source": {
						"Text": "Right Ctrl"
					},
					"Translation": {
						"Text": "右Ctrl键"
					},
					"Key": "RightControl"
				},
				{
					"Source": {
						"Text": "Right Mouse Button"
					},
					"Translation": {
						"Text": "鼠标右键"
					},
					"Key": "RightMouseButton"
				},
				{
					"Source": {
						"Text": "Right Parantheses"
					},
					"Translation": {
						"Text": "右圆括号”)”"
					},
					"Key": "RightParantheses"
				},
				{
					"Source": {
						"Text": "Right Shift"
					},
					"Translation": {
						"Text": "右Shift键"
					},
					"Key": "RightShift"
				},
				{
					"Source": {
						"Text": "Rotate"
					},
					"Translation": {
						"Text": "旋转"
					},
					"Key": "Gesture_Rotate"
				},
				{
					"Source": {
						"Text": "Rotation Rate"
					},
					"Translation": {
						"Text": "旋转速度"
					},
					"Key": "RotationRate"
				},
				{
					"Source": {
						"Text": "Scroll Lock"
					},
					"Translation": {
						"Text": "滚动锁定键”Scroll Lock”"
					},
					"Key": "ScrollLock"
				},
				{
					"Source": {
						"Text": "Semicolon"
					},
					"Translation": {
						"Text": "分号键”;”"
					},
					"Key": "Semicolon"
				},
				{
					"Source": {
						"Text": "Slash"
					},
					"Translation": {
						"Text": "斜杠”/”"
					},
					"Key": "Slash"
				},
				{
					"Source": {
						"Text": "Space"
					},
					"Translation": {
						"Text": "空格"
					},
					"Key": "SpaceBarShort"
				},
				{
					"Source": {
						"Text": "Space Bar"
					},
					"Translation": {
						"Text": "空格键"
					},
					"Key": "SpaceBar"
				},
				{
					"Source": {
						"Text": "SpecialGamepad"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "SpecialGamepadSubCategory"
				},
				{
					"Source": {
						"Text": "Steam"
					},
					"Translation": {
						"Text": "Steam"
					},
					"Key": "SteamSubCateogry"
				},
				{
					"Source": {
						"Text": "Steam Back Left"
					},
					"Translation": {
						"Text": "Steam左返回键"
					},
					"Key": "Steam_Back_Left"
				},
				{
					"Source": {
						"Text": "Steam Back Right"
					},
					"Translation": {
						"Text": "Steam右返回键"
					},
					"Key": "Steam_Back_Right"
				},
				{
					"Source": {
						"Text": "Steam Touch 0"
					},
					"Translation": {
						"Text": "Steam触摸按键0"
					},
					"Key": "Steam_Touch_0"
				},
				{
					"Source": {
						"Text": "Steam Touch 1"
					},
					"Translation": {
						"Text": "Steam触摸按键1"
					},
					"Key": "Steam_Touch_1"
				},
				{
					"Source": {
						"Text": "Steam Touch 2"
					},
					"Translation": {
						"Text": "Steam触摸按键2"
					},
					"Key": "Steam_Touch_2"
				},
				{
					"Source": {
						"Text": "Steam Touch 3"
					},
					"Translation": {
						"Text": "Steam触摸按键3"
					},
					"Key": "Steam_Touch_3"
				},
				{
					"Source": {
						"Text": "Tab"
					},
					"Translation": {
						"Text": "Tab键"
					},
					"Key": "Tab"
				},
				{
					"Source": {
						"Text": "Tap"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "Gesture_Tap"
				},
				{
					"Source": {
						"Text": "Thumb Mouse Button"
					},
					"Translation": {
						"Text": "鼠标拇指键"
					},
					"Key": "ThumbMouseButton"
				},
				{
					"Source": {
						"Text": "Thumb Mouse Button 2"
					},
					"Translation": {
						"Text": "鼠标拇指键2"
					},
					"Key": "ThumbMouseButton2"
				},
				{
					"Source": {
						"Text": "Tilt"
					},
					"Translation": {
						"Text": "倾斜"
					},
					"Key": "Tilt"
				},
				{
					"Source": {
						"Text": "Touch"
					},
					"Translation": {
						"Text": "触摸"
					},
					"Key": "TouchSubCateogry"
				},
				{
					"Source": {
						"Text": "Touch {0}"
					},
					"Translation": {
						"Text": "触摸{0}"
					},
					"Key": "TouchFormat"
				},
				{
					"Source": {
						"Text": "Touchpad Button X Axis"
					},
					"Translation": {
						"Text": "触摸板按钮 X 轴"
					},
					"Key": "Gamepad_Special_Left_X"
				},
				{
					"Source": {
						"Text": "Touchpad Button Y Axis"
					},
					"Translation": {
						"Text": "触摸板按钮 Y 轴"
					},
					"Key": "Gamepad_Special_Left_Y"
				},
				{
					"Source": {
						"Text": "Touchpad Touched"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "Gamepad_Special_Left_Touched"
				},
				{
					"Source": {
						"Text": "Underscore"
					},
					"Translation": {
						"Text": "下划线”_”"
					},
					"Key": "Underscore"
				},
				{
					"Source": {
						"Text": "Up"
					},
					"Translation": {
						"Text": "上方向键"
					},
					"Key": "Up"
				},
				{
					"Source": {
						"Text": "Valve Index"
					},
					"Translation": {
						"Text": "Valve Index"
					},
					"Key": "ValveIndexSubCategory"
				},
				{
					"Source": {
						"Text": "Valve Index (L) A Press"
					},
					"Translation": {
						"Text": "Valve Index（左）A点按"
					},
					"Key": "ValveIndex_Left_A_Click"
				},
				{
					"Source": {
						"Text": "Valve Index (L) A Touch"
					},
					"Translation": {
						"Text": "Valve Index（左）A轻触"
					},
					"Key": "ValveIndex_Left_A_Touch"
				},
				{
					"Source": {
						"Text": "Valve Index (L) B Press"
					},
					"Translation": {
						"Text": "Valve Index（左）B点按"
					},
					"Key": "ValveIndex_Left_B_Click"
				},
				{
					"Source": {
						"Text": "Valve Index (L) B Touch"
					},
					"Translation": {
						"Text": "Valve Index（左） B轻触"
					},
					"Key": "ValveIndex_Left_B_Touch"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Grip Axis"
					},
					"Translation": {
						"Text": "Valve Index（左）抓握轴"
					},
					"Key": "ValveIndex_Left_Grip_Axis"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Grip Force"
					},
					"Translation": {
						"Text": "Valve Index（左）抓握力度"
					},
					"Key": "ValveIndex_Left_Grip_Force"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Thumbstick 2D-Axis"
					},
					"Translation": {
						"Text": "Valve Index（左）摇杆 2D 轴"
					},
					"Key": "ValveIndex_Left_Thumbstick_2D"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Thumbstick Button"
					},
					"Translation": {
						"Text": "Valve Index（左）摇杆按键"
					},
					"Key": "ValveIndex_Left_Thumbstick_Click"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Thumbstick Down"
					},
					"Translation": {
						"Text": "Valve Index（左）摇杆下"
					},
					"Key": "ValveIndex_Left_Thumbstick_Down"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Thumbstick Left"
					},
					"Translation": {
						"Text": "Valve Index（左）摇杆左"
					},
					"Key": "ValveIndex_Left_Thumbstick_Left"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Thumbstick Right"
					},
					"Translation": {
						"Text": "Valve Index（左）摇杆右"
					},
					"Key": "ValveIndex_Left_Thumbstick_Right"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Thumbstick Touch"
					},
					"Translation": {
						"Text": "Valve Index（左）摇杆轻触"
					},
					"Key": "ValveIndex_Left_Thumbstick_Touch"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Thumbstick Up"
					},
					"Translation": {
						"Text": "Valve Index（左）摇杆上"
					},
					"Key": "ValveIndex_Left_Thumbstick_Up"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Thumbstick X-Axis"
					},
					"Translation": {
						"Text": "Valve Index（左）摇杆 X 轴"
					},
					"Key": "ValveIndex_Left_Thumbstick_X"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Thumbstick Y-Axis"
					},
					"Translation": {
						"Text": "Valve Index（左）摇杆 Y 轴"
					},
					"Key": "ValveIndex_Left_Thumbstick_Y"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Trackpad 2D-Axis"
					},
					"Translation": {
						"Text": "Valve Index（左）触控板 2D 轴"
					},
					"Key": "ValveIndex_Left_Trackpad_2D"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Trackpad Down"
					},
					"Translation": {
						"Text": "Valve Index（左）触控板下"
					},
					"Key": "ValveIndex_Left_Trackpad_Down"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Trackpad Force"
					},
					"Translation": {
						"Text": "Valve Index（左）触控板力度"
					},
					"Key": "ValveIndex_Left_Trackpad_Force"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Trackpad Left"
					},
					"Translation": {
						"Text": "Valve Index（左）触控板左"
					},
					"Key": "ValveIndex_Left_Trackpad_Left"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Trackpad Right"
					},
					"Translation": {
						"Text": "Valve Index（左）触控板右"
					},
					"Key": "ValveIndex_Left_Trackpad_Right"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Trackpad Touch"
					},
					"Translation": {
						"Text": "Valve Index（左）触控板轻触"
					},
					"Key": "ValveIndex_Left_Trackpad_Touch"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Trackpad Up"
					},
					"Translation": {
						"Text": "Valve Index（左）触控板上"
					},
					"Key": "ValveIndex_Left_Trackpad_Up"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Trackpad X"
					},
					"Translation": {
						"Text": "Valve Index（左）触控板 X"
					},
					"Key": "ValveIndex_Left_Trackpad_X"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Trackpad Y"
					},
					"Translation": {
						"Text": "Valve Index（左）触控板 Y"
					},
					"Key": "ValveIndex_Left_Trackpad_Y"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Trigger"
					},
					"Translation": {
						"Text": "Valve Index（左）扳机"
					},
					"Key": "ValveIndex_Left_Trigger_Click"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Trigger Axis"
					},
					"Translation": {
						"Text": "Valve Index（左）扳机轴"
					},
					"Key": "ValveIndex_Left_Trigger_Axis"
				},
				{
					"Source": {
						"Text": "Valve Index (L) Trigger Touch"
					},
					"Translation": {
						"Text": "Valve Index（左）扳机轻触"
					},
					"Key": "ValveIndex_Left_Trigger_Touch"
				},
				{
					"Source": {
						"Text": "Valve Index (R) A Press"
					},
					"Translation": {
						"Text": "Valve Index（右）A点按"
					},
					"Key": "ValveIndex_Right_A_Click"
				},
				{
					"Source": {
						"Text": "Valve Index (R) A Touch"
					},
					"Translation": {
						"Text": "Valve Index（右）A轻触"
					},
					"Key": "ValveIndex_Right_A_Touch"
				},
				{
					"Source": {
						"Text": "Valve Index (R) B Press"
					},
					"Translation": {
						"Text": "Valve Index（右）B点按"
					},
					"Key": "ValveIndex_Right_B_Click"
				},
				{
					"Source": {
						"Text": "Valve Index (R) B Touch"
					},
					"Translation": {
						"Text": "Valve Index（右）B轻触"
					},
					"Key": "ValveIndex_Right_B_Touch"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Grip Axis"
					},
					"Translation": {
						"Text": "Valve Index（右）抓握轴"
					},
					"Key": "ValveIndex_Right_Grip_Axis"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Grip Force"
					},
					"Translation": {
						"Text": "Valve Index（右）抓握力度"
					},
					"Key": "ValveIndex_Right_Grip_Force"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Thumbstick 2D-Axis"
					},
					"Translation": {
						"Text": "Valve Index（右）摇杆 2D 轴"
					},
					"Key": "ValveIndex_Right_Thumbstick_2D"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Thumbstick Button"
					},
					"Translation": {
						"Text": "Valve Index（右）摇杆按键"
					},
					"Key": "ValveIndex_Right_Thumbstick_Click"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Thumbstick Down"
					},
					"Translation": {
						"Text": "Valve Index（右）摇杆下"
					},
					"Key": "ValveIndex_Right_Thumbstick_Down"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Thumbstick Left"
					},
					"Translation": {
						"Text": "Valve Index（右）摇杆左"
					},
					"Key": "ValveIndex_Right_Thumbstick_Left"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Thumbstick Right"
					},
					"Translation": {
						"Text": "Valve Index（右）摇杆右"
					},
					"Key": "ValveIndex_Right_Thumbstick_Right"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Thumbstick Touch"
					},
					"Translation": {
						"Text": "Valve Index（右）摇杆轻触"
					},
					"Key": "ValveIndex_Right_Thumbstick_Touch"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Thumbstick Up"
					},
					"Translation": {
						"Text": "Valve Index（右）摇杆上"
					},
					"Key": "ValveIndex_Right_Thumbstick_Up"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Thumbstick X-Axis"
					},
					"Translation": {
						"Text": "Valve Index（右）摇杆 X 轴"
					},
					"Key": "ValveIndex_Right_Thumbstick_X"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Thumbstick Y-Axis"
					},
					"Translation": {
						"Text": "Valve Index（右）摇杆 Y 轴"
					},
					"Key": "ValveIndex_Right_Thumbstick_Y"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Trackpad 2D-Axis"
					},
					"Translation": {
						"Text": "Valve Index（右）触控板 2D 轴"
					},
					"Key": "ValveIndex_Right_Trackpad_2D"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Trackpad Down"
					},
					"Translation": {
						"Text": "Valve Index（右）触控板下"
					},
					"Key": "ValveIndex_Right_Trackpad_Down"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Trackpad Force"
					},
					"Translation": {
						"Text": "Valve Index（右）触控板力度"
					},
					"Key": "ValveIndex_Right_Trackpad_Force"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Trackpad Left"
					},
					"Translation": {
						"Text": "Valve Index（右）触控板左"
					},
					"Key": "ValveIndex_Right_Trackpad_Left"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Trackpad Right"
					},
					"Translation": {
						"Text": "Valve Index（右）触控板右"
					},
					"Key": "ValveIndex_Right_Trackpad_Right"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Trackpad Touch"
					},
					"Translation": {
						"Text": "Valve Index（右）触控板轻触"
					},
					"Key": "ValveIndex_Right_Trackpad_Touch"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Trackpad Up"
					},
					"Translation": {
						"Text": "Valve Index（右）触控板上"
					},
					"Key": "ValveIndex_Right_Trackpad_Up"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Trackpad X"
					},
					"Translation": {
						"Text": "Valve Index（右）触控板 X"
					},
					"Key": "ValveIndex_Right_Trackpad_X"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Trackpad Y"
					},
					"Translation": {
						"Text": "Valve Index（右）触控板 Y"
					},
					"Key": "ValveIndex_Right_Trackpad_Y"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Trigger"
					},
					"Translation": {
						"Text": "Valve Index（右）扳机"
					},
					"Key": "ValveIndex_Right_Trigger_Click"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Trigger Axis"
					},
					"Translation": {
						"Text": "Valve Index（右）扳机轴"
					},
					"Key": "ValveIndex_Right_Trigger_Axis"
				},
				{
					"Source": {
						"Text": "Valve Index (R) Trigger Touch"
					},
					"Translation": {
						"Text": "Valve Index（右）扳机轻触"
					},
					"Key": "ValveIndex_Right_Trigger_Touch"
				},
				{
					"Source": {
						"Text": "Virtual"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "VirtualSubCategory"
				},
				{
					"Source": {
						"Text": "Virtual Gamepad Accept"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "Virtual_Gamepad_Accept_Key"
				},
				{
					"Source": {
						"Text": "Virtual Gamepad Back"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "Virtual_Gamepad_Back_Key"
				},
				{
					"Source": {
						"Text": "Vive (L) Grip"
					},
					"Translation": {
						"Text": "Vive（左）抓握"
					},
					"Key": "Vive_Left_Grip_Click"
				},
				{
					"Source": {
						"Text": "Vive (L) Menu"
					},
					"Translation": {
						"Text": "Vive（左）菜单"
					},
					"Key": "Vive_Left_Menu_Click"
				},
				{
					"Source": {
						"Text": "Vive (L) Trackpad 2D-Axis"
					},
					"Translation": {
						"Text": "Vive（左）触控板 2D 轴"
					},
					"Key": "Vive_Left_Trackpad_2D"
				},
				{
					"Source": {
						"Text": "Vive (L) Trackpad Button"
					},
					"Translation": {
						"Text": "Vive（左）触控板按键"
					},
					"Key": "Vive_Left_Trackpad_Click"
				},
				{
					"Source": {
						"Text": "Vive (L) Trackpad Down"
					},
					"Translation": {
						"Text": "Vive（左）触控板下"
					},
					"Key": "Vive_Left_Trackpad_Down"
				},
				{
					"Source": {
						"Text": "Vive (L) Trackpad Left"
					},
					"Translation": {
						"Text": "Vive（左）触控板左"
					},
					"Key": "Vive_Left_Trackpad_Left"
				},
				{
					"Source": {
						"Text": "Vive (L) Trackpad Right"
					},
					"Translation": {
						"Text": "Vive（左）触控板右"
					},
					"Key": "Vive_Left_Trackpad_Right"
				},
				{
					"Source": {
						"Text": "Vive (L) Trackpad Touch"
					},
					"Translation": {
						"Text": "Vive（左）触控板轻触"
					},
					"Key": "Vive_Left_Trackpad_Touch"
				},
				{
					"Source": {
						"Text": "Vive (L) Trackpad Up"
					},
					"Translation": {
						"Text": "Vive（左）触控板上"
					},
					"Key": "Vive_Left_Trackpad_Up"
				},
				{
					"Source": {
						"Text": "Vive (L) Trackpad X-Axis"
					},
					"Translation": {
						"Text": "Vive（左）触控板 X 轴"
					},
					"Key": "Vive_Left_Trackpad_X"
				},
				{
					"Source": {
						"Text": "Vive (L) Trackpad Y-Axis"
					},
					"Translation": {
						"Text": "Vive（左）触控板 Y 轴"
					},
					"Key": "Vive_Left_Trackpad_Y"
				},
				{
					"Source": {
						"Text": "Vive (L) Trigger"
					},
					"Translation": {
						"Text": "Vive（左）扳机"
					},
					"Key": "Vive_Left_Trigger_Click"
				},
				{
					"Source": {
						"Text": "Vive (L) Trigger Axis"
					},
					"Translation": {
						"Text": "Vive（左）扳机轴"
					},
					"Key": "Vive_Left_Trigger_Axis"
				},
				{
					"Source": {
						"Text": "Vive (R) Grip"
					},
					"Translation": {
						"Text": "Vive（右）抓握"
					},
					"Key": "Vive_Right_Grip_Click"
				},
				{
					"Source": {
						"Text": "Vive (R) Menu"
					},
					"Translation": {
						"Text": "Vive（右）菜单"
					},
					"Key": "Vive_Right_Menu_Click"
				},
				{
					"Source": {
						"Text": "Vive (R) Trackpad 2D-Axis"
					},
					"Translation": {
						"Text": "Vive（右）触控板 2D 轴"
					},
					"Key": "Vive_Right_Trackpad_2D"
				},
				{
					"Source": {
						"Text": "Vive (R) Trackpad Button"
					},
					"Translation": {
						"Text": "Vive（右）触控板按键"
					},
					"Key": "Vive_Right_Trackpad_Click"
				},
				{
					"Source": {
						"Text": "Vive (R) Trackpad Down"
					},
					"Translation": {
						"Text": "Vive（右）触控板下"
					},
					"Key": "Vive_Right_Trackpad_Down"
				},
				{
					"Source": {
						"Text": "Vive (R) Trackpad Left"
					},
					"Translation": {
						"Text": "Vive（右）触控板左"
					},
					"Key": "Vive_Right_Trackpad_Left"
				},
				{
					"Source": {
						"Text": "Vive (R) Trackpad Right"
					},
					"Translation": {
						"Text": "Vive（右）触控板右"
					},
					"Key": "Vive_Right_Trackpad_Right"
				},
				{
					"Source": {
						"Text": "Vive (R) Trackpad Touch"
					},
					"Translation": {
						"Text": "Vive（右）触控板轻触"
					},
					"Key": "Vive_Right_Trackpad_Touch"
				},
				{
					"Source": {
						"Text": "Vive (R) Trackpad Up"
					},
					"Translation": {
						"Text": "Vive（右）触控板上"
					},
					"Key": "Vive_Right_Trackpad_Up"
				},
				{
					"Source": {
						"Text": "Vive (R) Trackpad X-Axis"
					},
					"Translation": {
						"Text": "Vive（右）触控板 X 轴"
					},
					"Key": "Vive_Right_Trackpad_X"
				},
				{
					"Source": {
						"Text": "Vive (R) Trackpad Y-Axis"
					},
					"Translation": {
						"Text": "Vive（右）触控板 Y 轴"
					},
					"Key": "Vive_Right_Trackpad_Y"
				},
				{
					"Source": {
						"Text": "Vive (R) Trigger"
					},
					"Translation": {
						"Text": "Vive（右）扳机"
					},
					"Key": "Vive_Right_Trigger_Click"
				},
				{
					"Source": {
						"Text": "Vive (R) Trigger Axis"
					},
					"Translation": {
						"Text": "Vive（右）扳机轴"
					},
					"Key": "Vive_Right_Trigger_Axis"
				},
				{
					"Source": {
						"Text": "Windows Mixed Reality"
					},
					"Translation": {
						"Text": "Windows Mixed Reality"
					},
					"Key": "MixedRealitySubCategory"
				},
				{
					"Source": {
						"Text": "XBox One"
					},
					"Translation": {
						"Text": "XBox One"
					},
					"Key": "XBoxOneSubCateogry"
				}
			]
		},
		{
			"Namespace": "LinuxDynamicRHI",
			"Children": [
				{
					"Source": {
						"Text": "Failed to load OpenGL Driver which is required to run the engine.\nOpenGL4 has been deprecated and should use Vulkan."
					},
					"Translation": {
						"Text": "无法加载运行引擎所需的OpenGL驱动程序。\nOpenGL4已被弃用，应使用Vulkan。"
					},
					"Key": "NoOpenGLDriver"
				},
				{
					"Source": {
						"Text": "Failed to load Vulkan Driver which is required to run the engine.\nThe engine no longer fallbacks to OpenGL4 which has been deprecated."
					},
					"Translation": {
						"Text": "无法加载运行引擎所需的Vulkan驱动程序。\n引擎不再回退到已弃用的OpenGL4。"
					},
					"Key": "NoVulkanDriver"
				},
				{
					"Source": {
						"Text": "Forced Vulkan device could not be created at the project's supported feature levels (see log for details)."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "ForcedVulkanSM"
				},
				{
					"Source": {
						"Text": "OpenGL 4.3 is required to run the engine."
					},
					"Translation": {
						"Text": "此引擎运行需要OpenGL 4.3。"
					},
					"Key": "RequiredOpenGL"
				},
				{
					"Source": {
						"Text": "The project does not target Vulkan or OpenGL RHIs, check project settings or pass -nullrhi."
					},
					"Translation": {
						"Text": "该项目没有目标Vulkan或OpenGL RHIs，检查项目设置或跳过。-nullrhi."
					},
					"Key": "NoTargetedRHI"
				},
				{
					"Source": {
						"Text": "Trying to force OpenGL RHI but the project does not have it in TargetedRHIs list."
					},
					"Translation": {
						"Text": "试图强制运行OpenGL RHI但该项目的TargetedRHIs表中缺失该内容。"
					},
					"Key": "NoOpenGLTargetedRHI"
				},
				{
					"Source": {
						"Text": "Trying to force Vulkan RHI but the project does not have it in TargetedRHIs list."
					},
					"Translation": {
						"Text": "试图强制运行Vulkan RHI但该项目的TargetedRHIs表中缺失该内容。"
					},
					"Key": "NoVulkanTargetedRHI"
				},
				{
					"Source": {
						"Text": "Trying to force specific Vulkan feature level but it is not supported."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "UnsupportedVulkanTargetedRHI"
				},
				{
					"Source": {
						"Text": "Vulkan Driver is required to run the engine."
					},
					"Translation": {
						"Text": "需要安装Vulkan驱动才能运行此引擎。"
					},
					"Key": "RequiredVulkan"
				},
				{
					"Source": {
						"Text": "Vulkan device could not be created at the project's supported feature levels (see log for details)."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "SupportedVulkanSM"
				},
				{
					"Source": {
						"Text": "Vulkan or OpenGL (4.3) support is required to run the engine."
					},
					"Translation": {
						"Text": "需要支持Vulkan或OpenGL(4.3)以运行该引擎。"
					},
					"Key": "NoVulkanNoGL"
				},
				{
					"Source": {
						"Text": "Warning: OpenGL is no longer supported for desktop platforms. Vulkan will be used instead."
					},
					"Translation": {
						"Text": "警告：桌面平台已不再支持OpenGL。将使用Vulkan代替。"
					},
					"Key": "OpenGLRemoved"
				}
			]
		},
		{
			"Namespace": "MessageDialog",
			"Children": [
				{
					"Source": {
						"Text": "Please update to the latest version of macOS for best performance and stability."
					},
					"Translation": {
						"Text": "请更新至最新版本的macOS以体验最佳性能与稳定性。"
					},
					"Key": "UpdateMacOSX_Body"
				},
				{
					"Source": {
						"Text": "The installed version of the {Vendor} graphics driver has known issues in {RHI}.\nPlease install either the latest or the recommended driver version or switch to a different rendering API.\n\nWould you like to visit the following URL to download the driver?\n\n{Hyperlink}\n\n{AdapterName}\nInstalled: {InstalledVer}\nRecommended: {RecommendedVer}"
					},
					"Translation": {
						"Text": "{Vendor} 图形驱动程序的安装版本在 {RHI} 存在已知问题。\n请安装最新版本或推荐的驱动程序版本，或者切换不同的渲染 API。\n\n您想访问以下 URL 以下载驱动程序吗？\n\n{Hyperlink}\n\n{AdapterName}\n已安装：{InstalledVer}\n推荐：{RecommendedVer}"
					},
					"Key": "VideoCardDriverRHIIssueReport"
				},
				{
					"Source": {
						"Text": "The installed version of the {Vendor} graphics driver has known issues.\nPlease install either the latest or the recommended driver version.\n\nWould you like to visit the following URL to download the driver?\n\n{Hyperlink}\n\n{AdapterName}\nInstalled: {InstalledVer}\nRecommended: {RecommendedVer}"
					},
					"Translation": {
						"Text": "{Vendor} 图形驱动程序的安装版本存在已知问题。\n请安装最新版本或推荐的驱动程序版本。\n\n您想访问以下 URL 以下载驱动程序吗？\n\n{Hyperlink}\n\n{AdapterName}\n已安装：{InstalledVer}\n推荐：{RecommendedVer}"
					},
					"Key": "VideoCardDriverIssueReport"
				},
				{
					"Source": {
						"Text": "Update macOS"
					},
					"Translation": {
						"Text": "更新macOS"
					},
					"Key": "UpdateMacOSX_Title"
				},
				{
					"Source": {
						"Text": "WARNING: Known issues with graphics driver"
					},
					"Translation": {
						"Text": "警告：存在已知的图形驱动问题。"
					},
					"Key": "TitleVideoCardDriverIssue"
				},
				{
					"Source": {
						"Text": "https://downloadcenter.intel.com/product/80939/Graphics"
					},
					"Translation": {
						"Text": "https://downloadcenter.intel.com/product/80939/Graphics"
					},
					"Key": "DriverDownloadLinkIntel"
				},
				{
					"Source": {
						"Text": "https://softwarecenter.qualcomm.com/catalog/item/Windows_Graphics_Driver"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "DriverDownloadLinkQualcomm"
				},
				{
					"Source": {
						"Text": "https://www.amd.com/en/support"
					},
					"Translation": {
						"Text": "https://www.amd.com/en/support"
					},
					"Key": "DriverDownloadLinkAMD"
				},
				{
					"Source": {
						"Text": "https://www.nvidia.com/en-us/geforce/drivers/"
					},
					"Translation": {
						"Text": "https://www.nvidia.com/en-us/geforce/drivers/"
					},
					"Key": "DriverDownloadLinkNVIDIA"
				},
				{
					"Source": {
						"Text": "latest driver available"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "LatestDriver"
				},
				{
					"Source": {
						"Text": "{0} or latest driver available"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "SuggestedDriverOrLatest"
				}
			]
		},
		{
			"Namespace": "UnrealBuildConfigurations",
			"Children": [
				{
					"Source": {
						"Text": "Debug"
					},
					"Translation": {
						"Text": "调试"
					},
					"Key": "DebugName"
				},
				{
					"Source": {
						"Text": "DebugGame"
					},
					"Translation": {
						"Text": "DebugGame"
					},
					"Key": "DebugGameName"
				},
				{
					"Source": {
						"Text": "Development"
					},
					"Translation": {
						"Text": "开发"
					},
					"Key": "DevelopmentName"
				},
				{
					"Source": {
						"Text": "Shipping"
					},
					"Translation": {
						"Text": "运输"
					},
					"Key": "ShippingName"
				},
				{
					"Source": {
						"Text": "Test"
					},
					"Translation": {
						"Text": "测试"
					},
					"Key": "TestName"
				},
				{
					"Source": {
						"Text": "Unknown"
					},
					"Translation": {
						"Text": "未知"
					},
					"Key": "UnknownName"
				}
			]
		},
		{
			"Namespace": "WindowsDynamicRHI",
			"Children": [
				{
					"Source": {
						"Text": "-d3d12/dx12, -d3d11/dx11, -vulkan, and -opengl are mutually exclusive options, but more than one was specified on the command-line."
					},
					"Translation": {
						"Text": "-d3d12/dx12、-d3d11/dx11、-vulkan 和 -opengl 是互斥的选项，但在命令行中指定了多个选项。"
					},
					"Key": "RHIOptionsError"
				},
				{
					"Source": {
						"Text": "<Unknown>"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "UnknownRHI"
				},
				{
					"Source": {
						"Text": "<unknown>"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "FeatureLevelUnknown"
				},
				{
					"Source": {
						"Text": "A D3D11-compatible GPU (Feature Level 11.0, Shader Model 5.0) is required to run the engine."
					},
					"Translation": {
						"Text": "运行此引擎需要兼容D3D11的GPU （功能级别11.0，着色器型号5.0）。"
					},
					"Key": "RequiredDX11Feature_11_SM5"
				},
				{
					"Source": {
						"Text": "DX12 SM6 is not supported on your system. Try running without the -sm6 command line argument."
					},
					"Translation": {
						"Text": "您的系统不支持 DX12 SM6。请尝试不使用 -sm6 命令行参数进行运行。"
					},
					"Key": "RequiredDX12SM6"
				},
				{
					"Source": {
						"Text": "DX12 is not supported on your system. Try running without the -dx12 or -d3d12 command line argument."
					},
					"Translation": {
						"Text": "DX12在您的系统上无法运行。请去除命令行中的-dx12 或 -d3d12。"
					},
					"Key": "RequiredDX12"
				},
				{
					"Source": {
						"Text": "DirectX 11"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "D3D11"
				},
				{
					"Source": {
						"Text": "DirectX 12"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "D3D12"
				},
				{
					"Source": {
						"Text": "ES3_1"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "FeatureLevelES31"
				},
				{
					"Source": {
						"Text": "OpenGL"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "OpenGL"
				},
				{
					"Source": {
						"Text": "OpenGL 4.3 is required to run the engine."
					},
					"Translation": {
						"Text": "此引擎运行需要OpenGL 4.3。"
					},
					"Key": "RequiredOpenGL"
				},
				{
					"Source": {
						"Text": "SM5"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "FeatureLevelSM4"
				},
				{
					"Source": {
						"Text": "SM6"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "FeatureLevelSM6"
				},
				{
					"Source": {
						"Text": "Unable to launch with RHI '{0}' since the project is not configured to support it."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "MissingTargetedShaderFormats"
				},
				{
					"Source": {
						"Text": "Vulkan"
					},
					"Translation": {
						"Text": ""
					},
					"Key": "Vulkan"
				},
				{
					"Source": {
						"Text": "Vulkan Driver is required to run the engine."
					},
					"Translation": {
						"Text": "需要安装Vulkan驱动才能运行此引擎。"
					},
					"Key": "RequiredVulkan"
				},
				{
					"Source": {
						"Text": "{0} does not support {1}."
					},
					"Translation": {
						"Text": ""
					},
					"Key": "RHINotSupported"
				}
			]
		}
	]
}